_Rarzrabotki/Rarus/USO2/Documents/УСОERP_РаспределениеИнвестиционногоНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УСОERP_РаспределениеИнвестиционногоНДС</Name>
			<Comment>Формирование сводных счетов-фактур для дольщиков (УСО)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПартииТоваровОрганизаций</xr:Item>
				<xr:Item>AccumulationRegister.СебестоимостьТоваров</xr:Item>
				<xr:Item>InformationRegister.ОтражениеДокументовВРеглУчете</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>InformationRegister.ОтражениеДокументовВМеждународномУчете</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УСОERP_СдачаОбъектаНедвижимости</v8:Type>
						<v8:Type>cfg:DocumentRef.УСОERP_ЗакрытиеОбъектаСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Comment>ЮИТ (для заполнения счетов фактур)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Comment>ЮИТ (для заполнения счетов фактур)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ОтветственныеЛицаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
					<Comment>ЮИТ (для заполнения счетов фактур)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ОтветственныеЛицаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоверенностьНомер</Name>
					<Comment>ЮИТ (для заполнения счетов фактур)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоверенностьДата</Name>
					<Comment>ЮИТ (для заполнения счетов фактур)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоверенностьВыдана</Name>
					<Comment>ЮИТ (для заполнения счетов фактур)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоверенностьЛицо</Name>
					<Comment>ЮИТ (для заполнения счетов фактур)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалогообложениеНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НДСИнвестиционный</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПоступления</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриобретениеУслугПрочихАктивов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчетаНДС</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДСПринятиеКУчету</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДСПередачаИнвестору</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПринятиеКУчету</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектНедвижимости</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлощадьФактическая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗатрат</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПоступления</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриобретениеУслугПрочихАктивов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчетаНДС</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетСписанияНДС</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СдачаИнвестору</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектНедвижимости</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлощадьФактическая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗатрат</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПоступления</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриобретениеУслугПрочихАктивов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДСПоДДУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезНДСПрочиеРасходы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДСПрочиеРасходы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетРасчетов</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетФактура</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/УСОERP_УчетнаяПолитикаПоДолевомуСтроительству.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>УСОERP_УчетнаяПолитикаПоДолевомуСтроительству</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатьяДДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетУчетаИнвестиционногоНДС</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмеренияПлощади</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатьяДоходовПоСанкциям</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиДоходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаНастроекФинУчетаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыФинансовогоУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаДоступаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмеренияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьФЗ214</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РаспределениеНДСЕжемесячно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/УСОERP_РаспределениеИнвестиционногоНДС/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроводкиРеглУчета

// Функция формирует и возвращает текст запроса для отражения документа в регламентированном учете.
//
Функция ТекстОтраженияВРеглУчете() Экспорт
	
	Если ПолучитьФункциональнуюОпцию("УСОERP_НоваяУчетнаяПолитикаПоДолевомуСтроительству") = Истина Тогда
		Возврат "";
	КонецЕсли;
	

	ТекстПринятиеКУчету = "
	|ВЫБРАТЬ //// Принятие к учету (Дт Счет списания НДС :: Кт Счет НДС)
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	Строки.СуммаНДС КАК Сумма,
	
	|	Строки.СуммаНДС КАК СуммаУУ,

	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВалютаДт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|	Строки.СчетСписанияНДС КАК СчетДт,
	|
	|	ВЫБОР КОГДА Строки.СчетСписанияНДС В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукция)) ТОГДА Строки.Номенклатура ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог) КОНЕЦ КАК СубконтоДт1,
	|	ВЫБОР КОГДА Строки.СчетСписанияНДС В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукция)) ТОГДА Операция.ДокументОснование.Склад ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	1 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|	УчетнаяПолитикаПоДолевомуСтроительству.СчетУчетаИнвестиционногоНДС КАК СчетКт,
	|	Строки.ДокументПоступления.Контрагент КАК СубконтоКт1,
	|	Строки.ДокументПоступления КАК СубконтоКт2,
	|	Операция.ОбъектСтроительства КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Принятие к учету"" КАК Содержание
	|
	|ИЗ
	|	Документ.УСОERP_РаспределениеИнвестиционногоНДС КАК Операция
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.УСОERP_РаспределениеИнвестиционногоНДС.ПринятиеКУчету КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УСОERP_УчетнаяПолитикаПоДолевомуСтроительству.СрезПоследних КАК УчетнаяПолитикаПоДолевомуСтроительству
	|	ПО Операция.Организация = УчетнаяПолитикаПоДолевомуСтроительству.Организация
	|ГДЕ
	|	Операция.Ссылка = &Ссылка";
	
	ТекстСдачаИнвестору = "
	|ВЫБРАТЬ //// Сдача инвестору (Дт Счет расчетов :: Кт ?????)
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	Строки.СуммаНДС КАК Сумма,
	
	|	Строки.СуммаНДС КАК СуммаУУ,

	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВалютаДт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|	Строки.СчетРасчетов КАК СчетДт,
	|
	|	Строки.Контрагент КАК СубконтоДт1,
	|	Строки.Договор КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|	УчетнаяПолитикаПоДолевомуСтроительству.СчетУчетаИнвестиционногоНДС КАК СчетКт,
	|	Строки.ДокументПоступления.Контрагент КАК СубконтоКт1,
	|	Строки.ДокументПоступления КАК СубконтоКт2,
	|	Операция.ОбъектСтроительства КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Сдача инвестору"" КАК Содержание
	|
	|ИЗ
	|	Документ.УСОERP_РаспределениеИнвестиционногоНДС КАК Операция
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.УСОERP_РаспределениеИнвестиционногоНДС.СдачаИнвестору КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УСОERP_УчетнаяПолитикаПоДолевомуСтроительству.СрезПоследних КАК УчетнаяПолитикаПоДолевомуСтроительству
	|	ПО Операция.Организация = УчетнаяПолитикаПоДолевомуСтроительству.Организация
	|
	|ГДЕ
	|	Операция.Ссылка = &Ссылка";
	
	Возврат ТекстПринятиеКУчету 
			+ " ОБЪЕДИНИТЬ ВСЕ " + ТекстСдачаИнвестору;

КонецФункции // ТекстОтраженияВРеглУчете()

#КонецОбласти

#Область Проведение

// Процедура инициализирует данные документа для их последующего отражения в связанных с документом регистрах.
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ДокументСсылка);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДанныеДокумента.Дата КАК Период,
	               |	ДанныеДокумента.Организация КАК Организация,
	               |	ДанныеДокумента.ОбъектСтроительства КАК ОбъектСтроительства,
	               |	ДанныеДокумента.ДокументОснование.Склад КАК Склад
	               |ИЗ
	               |	Документ.УСОERP_РаспределениеИнвестиционногоНДС КАК ДанныеДокумента
	               |ГДЕ
	               |	ДанныеДокумента.Ссылка = &ТекущийДокумент";
				   
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	
	Запрос.УстановитьПараметр("Период",                     Реквизиты.Период);
	Запрос.УстановитьПараметр("Организация",                Реквизиты.Организация);
	Запрос.УстановитьПараметр("Склад",                      Реквизиты.Склад);
	Запрос.УстановитьПараметр("УчитыватьПоВидамЗапасов",    ПолучитьФункциональнуюОпцию("УчитыватьСебестоимостьТоваровПоВидамЗапасов"));
	Запрос.УстановитьПараметр("ИспользоватьПартионныйУчет", ПолучитьФункциональнуюОпцию("ИспользоватьПартионныйУчет"));

	Запрос.Текст = ТекстЗапросаТаблицаПринятиеКУчету()
				 + ТекстЗапросаТаблицаСебестоимостьТоваров()
				 + ТекстЗапросаТаблицаПартииТоваровОрганизаций();
				 
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаСебестоимостьТоваров"	  , Результат[1].Выгрузить());
	ТаблицыДляДвижений.Вставить("ТаблицаПартииТоваровОрганизаций" , Результат[2].Выгрузить());
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Функция формирует и возвращает текст запроса для подготовки виртуальной таблицы по табл. части "Принятие к учету".
//
Функция ТекстЗапросаТаблицаПринятиеКУчету()
	
	ТекстЗапроса = "ВЫБРАТЬ //// [1] ТаблицаПринятиеКУчету
	               |	ТаблицаПринятиеКУчету.НомерСтроки КАК НомерСтроки,
	               |	ТаблицаПринятиеКУчету.Номенклатура КАК Номенклатура,
	               |	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	               |	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	               |	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	               |	АналитикаУчетаНоменклатуры.КлючАналитики КАК АналитикаУчетаНоменклатуры,
	               |	1 КАК Количество,
	               |	ТаблицаПринятиеКУчету.СуммаБезНДС + ТаблицаПринятиеКУчету.СуммаНДС КАК Сумма,
	               |	ТаблицаПринятиеКУчету.СуммаБезНДС КАК СуммаБезНДС,
				   |	ТаблицаПринятиеКУчету.СуммаНДС КАК СуммаНДС,
	               |	0 КАК СуммаПР,
	               |	0 КАК СуммаВР,
	               |	ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) КАК ВидЗапасов,
	               |	ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка) КАК НомерГТД,
	               |	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КАК АналитикаУчетаПартий
	               |ПОМЕСТИТЬ ТаблицаПринятиеКУчету
	               |ИЗ
	               |	Документ.УСОERP_РаспределениеИнвестиционногоНДС.ПринятиеКУчету КАК ТаблицаПринятиеКУчету
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры
	               |		ПО ТаблицаПринятиеКУчету.Номенклатура = АналитикаУчетаНоменклатуры.Номенклатура
	               |			И (АналитикаУчетаНоменклатуры.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
	               |			И (АналитикаУчетаНоменклатуры.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка))
	               |			И (АналитикаУчетаНоменклатуры.МестоХранения = &Склад)
	               |ГДЕ
	               |	ТаблицаПринятиеКУчету.Ссылка = &ТекущийДокумент
				   |	И ТаблицаПринятиеКУчету.СчетСписанияНДС В ИЕРАРХИИ(Значение(ПланСчетов.Хозрасчетный.ГотоваяПродукция))
	               |;
	               |////////////////////////////////////////////////////////////////////////////////
	               |";
	
	Возврат ТекстЗапроса;
	
КонецФункции // ТекстЗапросаТаблицаПринятиеКУчету()

// Функция формирует и возвращает текст запроса для проведения документа по регистру накопления "Себестоимость товаров".
//
Функция ТекстЗапросаТаблицаСебестоимостьТоваров()
	
	ТекстЗапроса = "ВЫБРАТЬ //// [3] СебестоимостьТоваров
	               |	ТаблицаПринятиеКУчету.НомерСтроки КАК НомерСтроки,
	               |	&Период КАК Период,
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	               |	&Организация КАК Организация,
	               |	ТаблицаПринятиеКУчету.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	               |	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах) КАК РазделУчета,
	               |	ВЫБОР
	               |		КОГДА &УчитыватьПоВидамЗапасов
	               |			ТОГДА ТаблицаПринятиеКУчету.ВидЗапасов
	               |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	               |	КОНЕЦ КАК ВидЗапасов,
	               |	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОприходованиеТоваров) КАК ХозяйственнаяОперация,
	               |	ТаблицаПринятиеКУчету.Сумма КАК Стоимость,
	               |	ТаблицаПринятиеКУчету.СуммаБезНДС КАК СтоимостьБезНДС,
	               |	ТаблицаПринятиеКУчету.Сумма КАК СтоимостьРегл,
	               |	ТаблицаПринятиеКУчету.СуммаПР КАК ПостояннаяРазница,
	               |	ТаблицаПринятиеКУчету.СуммаВР КАК ВременнаяРазница,
	               |	ТаблицаПринятиеКУчету.Количество КАК Количество
	               |ИЗ
	               |	ТаблицаПринятиеКУчету КАК ТаблицаПринятиеКУчету
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСтроки
	               |;
	               |////////////////////////////////////////////////////////////////////////////////
	               |";
	
	Возврат ТекстЗапроса;
	
КонецФункции // ТекстЗапросаТаблицаСебестоимостьТоваров()

// Функция формирует и возвращает текст запроса для проведения документа по регистру накопления "Партии товаров организаций".
//
Функция ТекстЗапросаТаблицаПартииТоваровОрганизаций()
	
	ТекстЗапроса = "ВЫБРАТЬ //// [2] ПартииТоваровОрганизаций
	               |	ТаблицаПринятиеКУчету.НомерСтроки КАК НомерСтроки,
	               |	&Период КАК Период,
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	               |	&Организация КАК Организация,
	               |	ТаблицаПринятиеКУчету.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	               |	&ТекущийДокумент КАК ДокументПоступления,
	               |	ТаблицаПринятиеКУчету.ВидЗапасов КАК ВидЗапасов,
	               |	ТаблицаПринятиеКУчету.Количество КАК Количество,
	               |	ТаблицаПринятиеКУчету.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	               |	ТаблицаПринятиеКУчету.Сумма КАК Стоимость,
	               |	ТаблицаПринятиеКУчету.СуммаБезНДС КАК СтоимостьБезНДС,
	               |	ТаблицаПринятиеКУчету.Сумма КАК СтоимостьРегл,
	               |	ТаблицаПринятиеКУчету.СуммаПР КАК ПостояннаяРазница,
	               |	ТаблицаПринятиеКУчету.СуммаВР КАК ВременнаяРазница,
	               |	ТаблицаПринятиеКУчету.СуммаНДС КАК НДСРегл,
	               |	ТаблицаПринятиеКУчету.Номенклатура КАК Номенклатура,
	               |	ТаблицаПринятиеКУчету.Характеристика КАК Характеристика,
	               |	ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка) КАК НалогообложениеНДС,
	               |	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОприходованиеТоваров) КАК ХозяйственнаяОперация,
	               |	ИСТИНА КАК Первичное,
	               |	НЕОПРЕДЕЛЕНО КАК ДокументИсточник
	               |ИЗ
	               |	ТаблицаПринятиеКУчету КАК ТаблицаПринятиеКУчету
	               |ГДЕ
	               |	&ИспользоватьПартионныйУчет
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСтроки
	               |;
	               |////////////////////////////////////////////////////////////////////////////////
	               |";
	
	Возврат ТекстЗапроса;
	
КонецФункции // ТекстЗапросаТаблицаПартииТоваровОрганизаций()

// Функция возвращает текст запроса дополнительных временных таблиц, 
// необходимых для отражения в регламетированном учете
//
Функция ТекстЗапросаВТОтраженияВРеглУчете() Экспорт
	
	ТекстЗапроса = "";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область ЗаписьКнигиПокупок

// Процедура формирует сторнирующие документы "Запись книги покупок" по данным регистра накопления "НДС Покупки".
//
Процедура СформироватьДокументыЗаписьКнигиПокупок(ДокументСсылка, Отказ) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("НачалоПериода"	 , НачалоМесяца(ДокументСсылка.Дата));
	Запрос.УстановитьПараметр("ОкончаниеПериода" , КонецМесяца(ДокументСсылка.Дата));
	Запрос.УстановитьПараметр("ТекущийДокумент"	 , ДокументСсылка);
	Запрос.УстановитьПараметр("Счет68"	         , ПланыСчетов.Хозрасчетный.РасчетыПоНалогам);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПринятиеКУчету.ДокументПоступления КАК СчетФактура,
	|	ПринятиеКУчету.СчетУчетаНДС КАК СчетУчетаНДС,
	|	ПринятиеКУчету.Номенклатура,
	|	ПринятиеКУчету.СуммаБезНДС,
	|	ПринятиеКУчету.СуммаНДС,
	|	ПринятиеКУчету.НомерСтроки
	|ПОМЕСТИТЬ ВТПринятиеКУчету
	|ИЗ
	|	Документ.УСОERP_РаспределениеИнвестиционногоНДС.ПринятиеКУчету КАК ПринятиеКУчету
	|ГДЕ
	|	ПринятиеКУчету.Ссылка = &ТекущийДокумент
	|	И ПринятиеКУчету.СчетСписанияНДС В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоНалогам))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТПринятиеКУчету.СчетФактура КАК СчетФактура,
	|	ВТПринятиеКУчету.СчетУчетаНДС КАК СчетУчетаНДС,
	|	ДокументЗаписьКнигиПокупок.Ссылка КАК ЗаписьКнигиПокупок,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ПрочиеРаботыИУслуги) КАК ВидЦенности,
	|	ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПокупки.ПереданНДСНаСтроительство) КАК Событие,
	|	ВТПринятиеКУчету.Номенклатура,
	|	ВТПринятиеКУчету.СуммаБезНДС КАК Сумма,
	|	ВТПринятиеКУчету.СуммаНДС,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА ВТПринятиеКУчету.СуммаБезНДС = 0
	|					ТОГДА 0
	|				ИНАЧЕ ВЫРАЗИТЬ(ВТПринятиеКУчету.СуммаНДС / ВТПринятиеКУчету.СуммаБезНДС КАК ЧИСЛО(15, 2))
	|			КОНЕЦ = 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|		КОГДА ВЫБОР
	|				КОГДА ВТПринятиеКУчету.СуммаБезНДС = 0
	|					ТОГДА 0
	|				ИНАЧЕ ВЫРАЗИТЬ(ВТПринятиеКУчету.СуммаНДС / ВТПринятиеКУчету.СуммаБезНДС КАК ЧИСЛО(15, 2))
	|			КОНЕЦ = 0.18
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
	|		КОГДА ВЫБОР
	|				КОГДА ВТПринятиеКУчету.СуммаБезНДС = 0
	|					ТОГДА 0
	|				ИНАЧЕ ВЫРАЗИТЬ(ВТПринятиеКУчету.СуммаНДС / ВТПринятиеКУчету.СуммаБезНДС КАК ЧИСЛО(15, 2))
	|			КОНЕЦ = 0.2
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	|		КОГДА ВЫБОР
	|				КОГДА ВТПринятиеКУчету.СуммаБезНДС = 0
	|					ТОГДА 0
	|				ИНАЧЕ ВЫРАЗИТЬ(ВТПринятиеКУчету.СуммаНДС / ВТПринятиеКУчету.СуммаБезНДС КАК ЧИСЛО(15, 2))
	|			КОНЕЦ = 0.1
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	|	КОНЕЦ КАК СтавкаНДС,
	|	ВТПринятиеКУчету.НомерСтроки КАК ИдентификаторСтроки
	|ИЗ
	|	ВТПринятиеКУчету КАК ВТПринятиеКУчету
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаписьКнигиПокупок.Ценности КАК ДокументЗаписьКнигиПокупок
	|		ПО ВТПринятиеКУчету.СчетФактура = ДокументЗаписьКнигиПокупок.Ссылка.ДокументРасчетов
	|			И (ДокументЗаписьКнигиПокупок.Ссылка.УСОERP_СторнируемыйДокумент = ЗНАЧЕНИЕ(Документ.ЗаписьКнигиПокупок.ПустаяСсылка))
	|ИТОГИ
	|	МАКСИМУМ(ЗаписьКнигиПокупок)
	|ПО
	|	СчетФактура";
	
	ВыборкаСФ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСФ.Следующий() Цикл
		
		Если ЗначениеЗаполнено(ВыборкаСФ.ЗаписьКнигиПокупок) Тогда
			ЗаписьКнигиПокупок = ВыборкаСФ.ЗаписьКнигиПокупок.ПолучитьОбъект();
		Иначе
			ЗаписьКнигиПокупок = Документы.ЗаписьКнигиПокупок.СоздатьДокумент();
		КонецЕсли;
		
		ДокументПоступления	 = ВыборкаСФ.СчетФактура;
		ЗаполняемыеСвойства	 = "Организация, Контрагент, Валюта, Подразделение";
		СообщениеОбОшибке	 = НСтр("ru='Не удалось создать документ ""Запись книги покупок"" по причине:'");
		
		ЗаполнитьЗначенияСвойств(ЗаписьКнигиПокупок, ДокументПоступления, ЗаполняемыеСвойства);
		ЗаписьКнигиПокупок.Ценности.Очистить();
		
		ЗаписьКнигиПокупок.СпособКорректировкиНДС = Перечисления.СпособыКорректировкиНДС.Отложить;
		ЗаписьКнигиПокупок.ДокументРасчетов       = ДокументПоступления;
		ЗаписьКнигиПокупок.Дата					  = ДокументСсылка.Дата;
		
		Выборка = ВыборкаСФ.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ЗаписьКнигиПокупок.Ценности.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		КонецЦикла;
		
		
		Попытка
			ЗаписьКнигиПокупок.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке + " " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке()), , , , Отказ);
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры // СформироватьСторнирующиеДокументыЗаписьКнигиПокупок()

#КонецОбласти

#Область Заполнение

Функция ПолучитьДанныеЗаполненияИнвестиционныйНДС(СтруктураПараметров) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УСОERP_НДСИнвестиционныйОстатки.Контрагент КАК Контрагент,
	|	УСОERP_НДСИнвестиционныйОстатки.ДокументПоступления КАК ДокументПоступления,
	|	NULL КАК Номенклатура,
	|	УСОERP_НДСИнвестиционныйОстатки.СчетУчетаНДС КАК СчетУчетаНДС,
	|	УСОERP_НДСИнвестиционныйОстатки.СуммаБезНДСОстаток КАК СуммаБезНДС,
	|	УСОERP_НДСИнвестиционныйОстатки.СуммаНДСОстаток КАК СуммаНДС
	|ПОМЕСТИТЬ ВТ_ИнвестиционныйНДС
	|ИЗ
	|	РегистрНакопления.УСОERP_НДСИнвестиционный.Остатки(
	|			&Дата,
	|			Организация = &Организация
	|				И ОбъектСтроительства = &ОбъектСтроительства
	|				И ДокументПоступления ССЫЛКА Документ.ПриобретениеУслугПрочихАктивов
	|				И Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК УСОERP_НДСИнвестиционныйОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УСОERP_НДСИнвестиционныйОстатки.Контрагент,
	|	УСОERP_НДСИнвестиционныйОстатки.ДокументПоступления,
	|	УСОERP_НДСИнвестиционныйОстатки.Номенклатура,
	|	УСОERP_НДСИнвестиционныйОстатки.СчетУчетаНДС,
	|	СУММА(ЕСТЬNULL(ПартииТоваровОрганизацийОбороты.СтоимостьРеглРасход, 0)),
	|	СУММА(ЕСТЬNULL(ПартииТоваровОрганизацийОбороты.НДСРеглРасход, 0))
	|ИЗ
	|	РегистрНакопления.УСОERP_НДСИнвестиционный.Остатки(
	|			&Дата,
	|			Организация = &Организация
	|				И ОбъектСтроительства = &ОбъектСтроительства
	|				И НЕ Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК УСОERP_НДСИнвестиционныйОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровОрганизаций.Обороты(&НачалоСтроительства, &ОкончаниеСтроительства, , Организация = &Организация) КАК ПартииТоваровОрганизацийОбороты
	|		ПО УСОERP_НДСИнвестиционныйОстатки.Номенклатура = ПартииТоваровОрганизацийОбороты.АналитикаУчетаНоменклатуры.Номенклатура
	|			И УСОERP_НДСИнвестиционныйОстатки.ДокументПоступления = ПартииТоваровОрганизацийОбороты.ДокументПоступления
	|
	|СГРУППИРОВАТЬ ПО
	|	УСОERP_НДСИнвестиционныйОстатки.Номенклатура,
	|	УСОERP_НДСИнвестиционныйОстатки.СчетУчетаНДС,
	|	УСОERP_НДСИнвестиционныйОстатки.Контрагент,
	|	УСОERP_НДСИнвестиционныйОстатки.ДокументПоступления
	|
	|ИМЕЮЩИЕ
	|	СУММА(ЕСТЬNULL(ПартииТоваровОрганизацийОбороты.СтоимостьРеглРасход, 0)) <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИнвестиционныйНДС.Контрагент КАК Контрагент,
	|	ВТ_ИнвестиционныйНДС.ДокументПоступления КАК ДокументПоступления,
	|	ВТ_ИнвестиционныйНДС.Номенклатура КАК Номенклатура,
	|	ВТ_ИнвестиционныйНДС.СчетУчетаНДС КАК СчетУчетаНДС,
	|	ВТ_ИнвестиционныйНДС.СуммаБезНДС КАК СуммаБезНДС,
	|	ВТ_ИнвестиционныйНДС.СуммаНДС КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА ВТ_ИнвестиционныйНДС.СуммаБезНДС = 0
	|					ТОГДА 0
	|				ИНАЧЕ ВЫРАЗИТЬ(ВТ_ИнвестиционныйНДС.СуммаНДС / ВТ_ИнвестиционныйНДС.СуммаБезНДС КАК ЧИСЛО(15, 2))
	|			КОНЕЦ = 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|		КОГДА ВЫБОР
	|				КОГДА ВТ_ИнвестиционныйНДС.СуммаБезНДС = 0
	|					ТОГДА 0
	|				ИНАЧЕ ВЫРАЗИТЬ(ВТ_ИнвестиционныйНДС.СуммаНДС / ВТ_ИнвестиционныйНДС.СуммаБезНДС КАК ЧИСЛО(15, 2))
	|			КОНЕЦ = 0.18
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
	|		КОГДА ВЫБОР
	|				КОГДА ВТ_ИнвестиционныйНДС.СуммаБезНДС = 0
	|					ТОГДА 0
	|				ИНАЧЕ ВЫРАЗИТЬ(ВТ_ИнвестиционныйНДС.СуммаНДС / ВТ_ИнвестиционныйНДС.СуммаБезНДС КАК ЧИСЛО(15, 2))
	|			КОНЕЦ = 0.2
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	|		КОГДА ВЫБОР
	|				КОГДА ВТ_ИнвестиционныйНДС.СуммаБезНДС = 0
	|					ТОГДА 0
	|				ИНАЧЕ ВЫРАЗИТЬ(ВТ_ИнвестиционныйНДС.СуммаНДС / ВТ_ИнвестиционныйНДС.СуммаБезНДС КАК ЧИСЛО(15, 2))
	|			КОНЕЦ = 0.1
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
	|	КОНЕЦ КАК СтавкаНДС,
	|	ВЫБОР
	|		КОГДА &РасчетПоСуммеЗатрат
	|			ТОГДА ВЫБОР
	|					КОГДА &ИтогоСуммаЗатрат = 0
	|						ТОГДА 0
	|					ИНАЧЕ ВТ_ИнвестиционныйНДС.СуммаНДС * &ИтогоСуммаЗатратПринятиеКУчету / &ИтогоСуммаЗатрат
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ИтогоПлощадьФактическая = 0
	|					ТОГДА 0
	|				ИНАЧЕ ВТ_ИнвестиционныйНДС.СуммаНДС * &ИтогоПлощадьФактическаяПринятиеКУчету / &ИтогоПлощадьФактическая
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаНДСПринятиеКУчету,
	|	ВЫБОР
	|		КОГДА &РасчетПоСуммеЗатрат
	|			ТОГДА ВЫБОР
	|					КОГДА &ИтогоСуммаЗатрат = 0
	|						ТОГДА 0
	|					ИНАЧЕ ВТ_ИнвестиционныйНДС.СуммаНДС - ВТ_ИнвестиционныйНДС.СуммаНДС * &ИтогоСуммаЗатратПринятиеКУчету / &ИтогоСуммаЗатрат
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ИтогоПлощадьФактическая = 0
	|					ТОГДА 0
	|				ИНАЧЕ ВТ_ИнвестиционныйНДС.СуммаНДС - ВТ_ИнвестиционныйНДС.СуммаНДС * &ИтогоПлощадьФактическаяПринятиеКУчету / &ИтогоПлощадьФактическая
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаНДСПередачаИнвестору
	|ИЗ
	|	ВТ_ИнвестиционныйНДС КАК ВТ_ИнвестиционныйНДС
	|ГДЕ
	|	ВТ_ИнвестиционныйНДС.СуммаБезНДС <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УСОERP_ЗакрытиеОбъектаСтроительстваПринятиеКУчету.ОбъектНедвижимости КАК ОбъектНедвижимости,
	|	УСОERP_ЗакрытиеОбъектаСтроительстваПринятиеКУчету.Номенклатура КАК Номенклатура,
	|	УСОERP_ЗакрытиеОбъектаСтроительстваПринятиеКУчету.ПлощадьФактическая КАК ПлощадьФактическая,
	|	УСОERP_ЗакрытиеОбъектаСтроительстваПринятиеКУчету.СуммаЗатрат КАК СуммаЗатрат,
	|	УПН_РасчетыСКлиентамиПоОбъектамНедвижимостиОбороты.СуммаОборот КАК СуммаОборот,
	|	УПН_РасчетыСКлиентамиПоОбъектамНедвижимостиОбороты.ПлощадьОборот КАК ПлощадьОборот
	|ИЗ
	|	Документ.УСОERP_ЗакрытиеОбъектаСтроительства.ПринятиеКУчету КАК УСОERP_ЗакрытиеОбъектаСтроительстваПринятиеКУчету
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.УПН_РасчетыСКлиентамиПоОбъектамНедвижимости.Обороты(, , Регистратор, ) КАК УПН_РасчетыСКлиентамиПоОбъектамНедвижимостиОбороты
	|		ПО УСОERP_ЗакрытиеОбъектаСтроительстваПринятиеКУчету.ОбъектНедвижимости = УПН_РасчетыСКлиентамиПоОбъектамНедвижимостиОбороты.ОбъектНедвижимости
	|			И (УПН_РасчетыСКлиентамиПоОбъектамНедвижимостиОбороты.Регистратор ССЫЛКА Документ.УПН_ДоговорПоНедвижимости)
	|ГДЕ
	|	УСОERP_ЗакрытиеОбъектаСтроительстваПринятиеКУчету.Ссылка = &ДокументОснование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УСОERP_СдачаОбъектаНедвижимостиПринятиеКУчету.ОбъектНедвижимости,
	|	УСОERP_СдачаОбъектаНедвижимостиПринятиеКУчету.Номенклатура,
	|	УСОERP_СдачаОбъектаНедвижимостиПринятиеКУчету.ПлощадьФактическая,
	|	УСОERP_СдачаОбъектаНедвижимостиПринятиеКУчету.СуммаЗатрат,
	|	УПН_РасчетыСКлиентамиПоОбъектамНедвижимостиОбороты.СуммаОборот,
	|	УПН_РасчетыСКлиентамиПоОбъектамНедвижимостиОбороты.ПлощадьОборот
	|ИЗ
	|	Документ.УСОERP_СдачаОбъектаНедвижимости.ПринятиеКУчету КАК УСОERP_СдачаОбъектаНедвижимостиПринятиеКУчету
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.УПН_РасчетыСКлиентамиПоОбъектамНедвижимости.Обороты(, , Регистратор, ) КАК УПН_РасчетыСКлиентамиПоОбъектамНедвижимостиОбороты
	|		ПО УСОERP_СдачаОбъектаНедвижимостиПринятиеКУчету.ОбъектНедвижимости = УПН_РасчетыСКлиентамиПоОбъектамНедвижимостиОбороты.ОбъектНедвижимости
	|			И (УПН_РасчетыСКлиентамиПоОбъектамНедвижимостиОбороты.Регистратор ССЫЛКА Документ.УПН_ДоговорПоНедвижимости)
	|ГДЕ
	|	УСОERP_СдачаОбъектаНедвижимостиПринятиеКУчету.Ссылка = &ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УСОERP_ЗакрытиеОбъектаСтроительстваСдачаИнвестору.ОбъектНедвижимости КАК ОбъектНедвижимости,
	|	УСОERP_ЗакрытиеОбъектаСтроительстваСдачаИнвестору.ПлощадьФактическая КАК ПлощадьФактическая,
	|	УСОERP_ЗакрытиеОбъектаСтроительстваСдачаИнвестору.СуммаЗатрат КАК СуммаЗатрат,
	|	УСОERP_ЗакрытиеОбъектаСтроительстваСдачаИнвестору.СчетРасчетов КАК СчетРасчетов,
	|	УСОERP_ЗакрытиеОбъектаСтроительстваСдачаИнвестору.Контрагент КАК Контрагент,
	|	УСОERP_ЗакрытиеОбъектаСтроительстваСдачаИнвестору.Договор КАК Договор,
	|	УПН_ДоговорПоНедвижимостиОбъектыНедвижимости.СуммаНДС КАК НДСПоДДУ
	|ИЗ
	|	Документ.УСОERP_ЗакрытиеОбъектаСтроительства.СдачаИнвестору КАК УСОERP_ЗакрытиеОбъектаСтроительстваСдачаИнвестору
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УПН_ДоговорПоНедвижимости.ОбъектыНедвижимости КАК УПН_ДоговорПоНедвижимостиОбъектыНедвижимости
	|		ПО УСОERP_ЗакрытиеОбъектаСтроительстваСдачаИнвестору.ОбъектНедвижимости = УПН_ДоговорПоНедвижимостиОбъектыНедвижимости.ОбъектНедвижимости
	|			И УСОERP_ЗакрытиеОбъектаСтроительстваСдачаИнвестору.Ссылка.Организация = УПН_ДоговорПоНедвижимостиОбъектыНедвижимости.Ссылка.Организация
	|ГДЕ
	|	УСОERP_ЗакрытиеОбъектаСтроительстваСдачаИнвестору.Ссылка = &ДокументОснование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УСОERP_СдачаОбъектаНедвижимостиСдачаИнвестору.ОбъектНедвижимости,
	|	УСОERP_СдачаОбъектаНедвижимостиСдачаИнвестору.ПлощадьФактическая,
	|	УСОERP_СдачаОбъектаНедвижимостиСдачаИнвестору.СуммаЗатрат,
	|	УСОERP_СдачаОбъектаНедвижимостиСдачаИнвестору.СчетРасчетов,
	|	УСОERP_СдачаОбъектаНедвижимостиСдачаИнвестору.Контрагент,
	|	УСОERP_СдачаОбъектаНедвижимостиСдачаИнвестору.Договор,
	|	УПН_ДоговорПоНедвижимостиОбъектыНедвижимости.СуммаНДС
	|ИЗ
	|	Документ.УСОERP_СдачаОбъектаНедвижимости.СдачаИнвестору КАК УСОERP_СдачаОбъектаНедвижимостиСдачаИнвестору
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УПН_ДоговорПоНедвижимости.ОбъектыНедвижимости КАК УПН_ДоговорПоНедвижимостиОбъектыНедвижимости
	|		ПО УСОERP_СдачаОбъектаНедвижимостиСдачаИнвестору.ОбъектНедвижимости = УПН_ДоговорПоНедвижимостиОбъектыНедвижимости.ОбъектНедвижимости
	|			И УСОERP_СдачаОбъектаНедвижимостиСдачаИнвестору.Ссылка.Организация = УПН_ДоговорПоНедвижимостиОбъектыНедвижимости.Ссылка.Организация
	|ГДЕ
	|	УСОERP_СдачаОбъектаНедвижимостиСдачаИнвестору.Ссылка = &ДокументОснование";

	Запрос.УстановитьПараметр("Организация",            СтруктураПараметров.Организация);
	Запрос.УстановитьПараметр("ОбъектСтроительства",    СтруктураПараметров.ОбъектСтроительства);
	Запрос.УстановитьПараметр("ДокументОснование",      СтруктураПараметров.ДокументОснование);
	Запрос.УстановитьПараметр("НачалоПериода",          СтруктураПараметров.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",           СтруктураПараметров.КонецПериода);
	Запрос.УстановитьПараметр("Дата",                   Новый Граница(СтруктураПараметров.Дата,ВидГраницы.Включая));
	Запрос.УстановитьПараметр("НачалоСтроительства",    СтруктураПараметров.НачалоСтроительства);
	Запрос.УстановитьПараметр("ОкончаниеСтроительства", СтруктураПараметров.ОкончаниеСтроительства);
	
	Запрос.УстановитьПараметр("ИтогоПлощадьФактическая",               СтруктураПараметров.ИтогоПлощадьФактическая);
	Запрос.УстановитьПараметр("ИтогоСуммаЗатрат",                      СтруктураПараметров.ИтогоСуммаЗатрат);
	Запрос.УстановитьПараметр("ИтогоПлощадьФактическаяПринятиеКУчету", СтруктураПараметров.ИтогоПлощадьФактическаяПринятиеКУчету);
	Запрос.УстановитьПараметр("ИтогоСуммаЗатратПринятиеКУчету",        СтруктураПараметров.ИтогоСуммаЗатратПринятиеКУчету);
	Запрос.УстановитьПараметр("ИтогоПлощадьФактическаяСдачаИнвестору", СтруктураПараметров.ИтогоПлощадьФактическаяСдачаИнвестору);
	Запрос.УстановитьПараметр("ИтогоСуммаЗатратСдачаИнвестору",        СтруктураПараметров.ИтогоСуммаЗатратСдачаИнвестору);
	
	Запрос.УстановитьПараметр("РасчетПоСуммеЗатрат", СтруктураПараметров.РасчетПоСуммеЗатрат);
	
	Пакет = Запрос.ВыполнитьПакет();
	
	ТЗ_ИнвестиционныйНДС = Пакет[1].Выгрузить();
	ТЗ_ПринятиеКУчету    = Пакет[2].Выгрузить();
	ТЗ_СдачаИнвестору    = Пакет[3].Выгрузить();
	
	Возврат Новый Структура("ИнвестиционныйНДС, ПринятиеКУчету, СдачаИнвестору", ТЗ_ИнвестиционныйНДС, ТЗ_ПринятиеКУчету, ТЗ_СдачаИнвестору);
	
КонецФункции

#КонецОбласти

#Область СозданиеНаОсновании

// Определяет список команд создания на основании.
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт

	
КонецПроцедуры

// Добавляет команду создания документа "Регистрация цен объектов недвижимости".
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт

	Если ПравоДоступа("Добавление", Метаданные.Документы.УСОERP_РаспределениеИнвестиционногоНДС) Тогда
		
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.УСОERP_РаспределениеИнвестиционногоНДС.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = ОбщегоНазначенияУТ.ПредставлениеОбъекта(Метаданные.Документы.УСОERP_РаспределениеИнвестиционногоНДС);
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции   

#КонецОбласти 

#Область Отчеты

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
	
КонецПроцедуры

#КонецОбласти


#Область Печать 
// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт 
	
	
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "РеестрСчетФактурПолученных";
	//КомандаПечати.Представление = НСтр("ru = 'Реестр счет-фактур полученных'");
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;


КонецПроцедуры

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РеестрСчетФактурПолученных") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "РеестрСчетФактурПолученных", "Реестр счет-фактур полученных", СформироватьПечатнуюФормуРеестрСчетФактурПолученных(МассивОбъектов, ОбъектыПечати,ПараметрыПечати));
	КонецЕсли;

	ФормированиеПечатныхФорм.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
	
КонецПроцедуры

Функция СформироватьПечатнуюФормуРеестрСчетФактурПолученных(МассивОбъектов, ОбъектыПечати,ПараметрыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Макет	= Документы.УСОERP_РаспределениеИнвестиционногоНДС.ПолучитьМакет("РеестрСчетФактурПолученных");
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СдачаИнвестору.ОбъектНедвижимости,
	|	СдачаИнвестору.ПлощадьФактическая,
	|	СдачаИнвестору.СуммаЗатрат,
	|	СдачаИнвестору.ДокументПоступления,
	|	СдачаИнвестору.НДСПоДДУ,
	|	СдачаИнвестору.СуммаБезНДС,
	|	СдачаИнвестору.СуммаНДС,
	|	СдачаИнвестору.СуммаБезНДСПрочиеРасходы,
	|	СдачаИнвестору.СуммаНДСПрочиеРасходы,
	|	СдачаИнвестору.СчетРасчетов,
	|	СдачаИнвестору.Контрагент,
	|	СдачаИнвестору.Договор,
	|	СдачаИнвестору.СчетФактура,
	|	СдачаИнвестору.ДокументПоступления.Контрагент КАК Поставщик,
	|	СдачаИнвестору.ДокументПоступления.Договор КАК ДоговорПоставщика
	|ИЗ
	|	Документ.УСОERP_РаспределениеИнвестиционногоНДС.СдачаИнвестору КАК СдачаИнвестору
	|ГДЕ
	|	СдачаИнвестору.Ссылка = &ДокументСсылка
	|	И СдачаИнвестору.Контрагент = &Контрагент
	|	И СдачаИнвестору.Договор = &Договор";
	
	Запрос.УстановитьПараметр("ДокументСсылка", МассивОбъектов);
	Запрос.УстановитьПараметр("Контрагент",ПараметрыПечати.Контрагент);
	Запрос.УстановитьПараметр("Договор",ПараметрыПечати.Договор);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;  	
	
	Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.Контрагент 	= ПараметрыПечати.Контрагент;
	Область.Параметры.Договор 		= ПараметрыПечати.Договор;
	ТабличныйДокумент.Вывести(Область);
	
	Для Каждого ТекСтрока Из Результат Цикл
		
		Строка = Макет.ПолучитьОбласть("Строка");
		Строка.Параметры.Поставщик 			= ТекСтрока.Поставщик;
		Строка.Параметры.ДоговорПоставщика 	= ТекСтрока.ДоговорПоставщика;
		Строка.Параметры.СчетФактура 		= ТекСтрока.ДокументПоступления;
		Строка.Параметры.СтавкаНДС 			= Перечисления.СтавкиНДС.НДС18;
		Строка.Параметры.СтавкаНДС 			= ?(ЗначениеЗаполнено(ТекСтрока.ДоговорПоставщика.СтавкаНДС),ТекСтрока.ДоговорПоставщика.СтавкаНДС,Перечисления.СтавкиНДС.НДС18);
		Строка.Параметры.СуммаБезНДС		= ТекСтрока.СуммаБезНДС;
		Строка.Параметры.НДС 				= ТекСтрока.СуммаНДС;
		Строка.Параметры.СуммаСНДС 			= ТекСтрока.СуммаБезНДС + ТекСтрока.СуммаНДС;
		
		ТабличныйДокумент.Вывести(Строка);
		
	КонецЦикла; 		
	
	Возврат ТабличныйДокумент;  	
	
КонецФункции 

// Функция формирует и возвращает текст запроса для подготовки виртуальной таблицы по табл. части "НДС инвестиционный".
//
Функция ТекстЗапросаТаблицаНДСИнвестиционный()
	
	ТекстЗапроса = "ВЫБРАТЬ //// [4] ТаблицаНДСИнвестиционный
	               |	ТаблицаНДСИнвестиционный.НомерСтроки КАК НомерСтроки,
	               |	&Период КАК Период,
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	               |	&Организация КАК Организация,
				   |	ТаблицаНДСИнвестиционный.Контрагент КАК Контрагент,
				   |	ТаблицаНДСИнвестиционный.ДокументПоступления КАК ДокументПоступления,
				   |	ТаблицаНДСИнвестиционный.Ссылка.ОбъектСтроительства КАК ОбъектСтроительства,
				   |	ТаблицаНДСИнвестиционный.СчетУчетаНДС КАК СчетУчетаНДС,
				   |	ТаблицаНДСИнвестиционный.Номенклатура КАК Номенклатура,
				   |	ТаблицаНДСИнвестиционный.СпособСтроительства КАК СпособСтроительства,
				   |	ТаблицаНДСИнвестиционный.СуммаБезНДС КАК СуммаБезНДС,
				   |	ТаблицаНДСИнвестиционный.СуммаНДС КАК СуммаНДС
	               |ИЗ
	               |	Документ.УСОERP_РаспределениеИнвестиционногоНДС.НДСИнвестиционный КАК ТаблицаНДСИнвестиционный
	               |ГДЕ
	               |	ТаблицаНДСИнвестиционный.Ссылка = &ТекущийДокумент
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСтроки
	               |;
	               |////////////////////////////////////////////////////////////////////////////////
	               |";
	
	Возврат ТекстЗапроса;
	
КонецФункции // ТекстЗапросаТаблицаПринятиеКУчету()

#Область ПрограммныйИнтерфейс

// Возвращает текст запроса для расчета необходимости ввода счета-фактуры выданного.
//	Возвращаемое значение:
//		Строка - текст запроса
//
Функция ТекстЗапросаДляРасчетаНеобходимостиСчетаФактуры() Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Ссылка КАК Основание,
	|	ДанныеДокумента.Ссылка.Дата КАК ДатаДокумента,
	|	ДанныеДокумента.Ссылка.Организация КАК Организация,
	|	ДанныеДокумента.Контрагент КАК Контрагент,
	|	ДанныеДокумента.Ссылка.Валюта КАК Валюта,
	|	ВЫБОР
	|		КОГДА ТаблицаСчетовФактуры.СчетФактура ЕСТЬ NULL 
	|				И ДанныеДокумента.Ссылка.Проведен
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Требуется
	|ИЗ
	|	Документ.УСОERP_РаспределениеИнвестиционногоНДС.СдачаИнвестору КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСчетовФактуры КАК ТаблицаСчетовФактуры
	|		ПО ДанныеДокумента.Ссылка = ТаблицаСчетовФактуры.Основание
	|			И ДанныеДокумента.Ссылка.Организация = ТаблицаСчетовФактуры.Организация
	|			И ДанныеДокумента.Контрагент = ТаблицаСчетовФактуры.Контрагент
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивОснований)";
		
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ТекстУсловия%", ТекстУсловияТребуетсяСчетФактура());
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Возвращает текст условия запроса, по которым документу требуется счет-фактура.
// Условие применяется для таблица "ДанныеДокумента", содержащую реквизиты документа.
//
// Параметры:
//	 ОграничитьПоТипуНалогообложения - Булево - Добавляет ограничительное условие на тип налогообложения.
//		см. РегистрыСведений.ТребуетсяОформлениеСчетаФактуры.МассивТиповНалогообложенияНДСТребуемыхОформления()
//
//	Возвращаемое значение:
//		Строка - текст условия запроса
//
Функция ТекстУсловияТребуетсяСчетФактура(ОграничитьПоТипуНалогообложения = Истина) Экспорт
	
	ТекстУсловия = "ИСТИНА";
		
	Возврат ТекстУсловия;
	
КонецФункции

// Формирует текст запроса для получения данных основания при печати Счет-фактуры.
//
Функция ТекстЗапросаДанныхОснованияДляПечатнойФормыСчетФактура() Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДанныеДокументов.Ссылка										КАК Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка) 	КАК ХозяйственнаяОперация,
	|	ДанныеДокументов.Валюта										КАК Валюта,
	|	ДанныеДокументов.Организация								КАК Организация,
	|	ДанныеДокументов.НалогообложениеНДС                         КАК НалогообложениеНДС, 
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)		КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)                  	КАК Склад,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)             	КАК Грузоотправитель,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)             	КАК Грузополучатель,
	|	ЛОЖЬ                                                      	КАК РасчетыЧерезОтдельногоКонтрагента,
	|	НЕОПРЕДЕЛЕНО                                              	КАК Номенклатура,
	|	""""                                                      	КАК Содержание,
	|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)             	КАК Комиссионер,
	|	НЕОПРЕДЕЛЕНО                                              	КАК Основание,
	|	НЕОПРЕДЕЛЕНО                                                КАК ОснованиеДата,
	|	НЕОПРЕДЕЛЕНО                                                КАК ОснованиеНомер, 
	|	НЕОПРЕДЕЛЕНО                                              	КАК ДоверенностьНомер,
	|	НЕОПРЕДЕЛЕНО                                              	КАК ДоверенностьДата,
	|	НЕОПРЕДЕЛЕНО                                              	КАК ДоверенностьВыдана,
	|	НЕОПРЕДЕЛЕНО                                              	КАК ДоверенностьЛицо,
	|	НЕОПРЕДЕЛЕНО                                              	КАК Кладовщик,
	|	НЕОПРЕДЕЛЕНО                                              	КАК ДолжностьКладовщика
	|
	|//ОператорПОМЕСТИТЬ
	|ИЗ
	|	Документ.УСОERP_РаспределениеИнвестиционногоНДС КАК ДанныеДокументов
	|ГДЕ
	|	ДанныеДокументов.Ссылка В (&ДокументОснование_УСОERP_РаспределениеИнвестиционногоНДС)";
		
	Возврат ТекстЗапроса;
	
КонецФункции

// Формирует временную таблицу, содержащую табличную часть по таблице данных документов.
//
// Параметры:
//	МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - Менеджер временных таблиц, содержащий таблицу ТаблицаДанныхДокументов с полями:
//		Ссылка,
//		Валюта.
//
//	ПараметрыЗаполнения - Структура - структура, возвращаемая функцией ПродажиСервер.ПараметрыЗаполненияВременнойТаблицыТоваров
//
Процедура ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц, ПараметрыЗаполнения = Неопределено) Экспорт
	
	Если ПараметрыЗаполнения = Неопределено Тогда
		ПараметрыЗаполнения = ПродажиСервер.ПараметрыЗаполненияВременнойТаблицыТоваров();
	КонецЕсли;
	
	ЗапросСФ = Новый Запрос;
	ЗапросСФ.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ЗапросСФ.Текст = "ВЫБРАТЬ
	|	СчетаФактурыОснования.Ссылка
	|ИЗ
	|	СчетаФактурыОснования КАК СчетаФактурыОснования";
	Результат = ЗапросСФ.Выполнить().Выгрузить();
	Результат.Свернуть("Ссылка");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", Константы.ВалютаРегламентированногоУчета.Получить());
	Запрос.УстановитьПараметр("ПересчитыватьВВалютуРегл",       ПараметрыЗаполнения.ПересчитыватьВВалютуРегл);
	Запрос.УстановитьПараметр("ПустаяГТД",                      Справочники.НомераГТД.ПустаяСсылка());
	
	Если Результат.Количество() <> 0 Тогда
		Запрос.УстановитьПараметр("СчетФактура",                      Результат[0].Ссылка);
	Иначе
		Запрос.УстановитьПараметр("СчетФактура",                      Документы.СчетФактураВыданный.ПустаяСсылка());
	КонецЕсли;
	
	Если ПараметрыЗаполнения.ПересчитыватьВВалютуРегл И ПараметрыЗаполнения.АктуализироватьРасчеты Тогда
		
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентами КАК РасчетыСКлиентами
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|		ТаблицаДанныхДокументов КАК ДанныеДокументов
		|	ПО
		|		РасчетыСКлиентами.Регистратор = ДанныеДокументов.Ссылка
		|
		|ГДЕ
		|	ДанныеДокументов.Валюта <> &ВалютаРегламентированногоУчета
		|	И РасчетыСКлиентами.Активность
		|";
		ТаблицаАналитик = Запрос.Выполнить().Выгрузить();
		МассивАналитикУчетаПоПартнерам = ТаблицаАналитик.ВыгрузитьКолонку("АналитикаУчетаПоПартнерам");
		
		ОкончаниеПериодаРасчета = ТекущаяДатаСеанса();
		РаспределениеВзаиморасчетовВызовСервера.РаспределитьВсеРасчетыСКлиентами(ОкончаниеПериодаРасчета, МассивАналитикУчетаПоПартнерам);
		
	КонецЕсли;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаДокумента.Ссылка КАК Ссылка,
	|	МАКСИМУМ(ТаблицаДокумента.НомерСтроки) КАК НомерСтроки,
	|	""Выполнение СМР по объекту строительства: "" + ТаблицаДокумента.Ссылка.ОбъектСтроительства.Наименование КАК Содержание,
	|	1 КАК Количество,
	|	1 КАК КоличествоУпаковок,
	|	ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) КАК ЕдиницаИзмерения,
	|	ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) КАК Упаковка,
	|	СУММА(ТаблицаДокумента.СуммаБезНДС) КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Договор.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
	|		ИНАЧЕ ТаблицаДокумента.Договор.СтавкаНДС
	|	КОНЕЦ КАК СтавкаНДС,
	|	СУММА(ТаблицаДокумента.СуммаНДС) КАК СуммаНДС,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	&ПустаяГТД КАК НомерГТД,
	|	ЛОЖЬ КАК ЭтоТовар,
	|	ЛОЖЬ КАК ВернутьМногооборотнуюТару
	|ПОМЕСТИТЬ УСОERP_РаспределениеИнвестиционногоНДСТаблицаТоваров
	|ИЗ
	|	Документ.УСОERP_РаспределениеИнвестиционногоНДС.СдачаИнвестору КАК ТаблицаДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокументов КАК ДанныеДокументов
	|		ПО ТаблицаДокумента.Ссылка = ДанныеДокументов.Ссылка
	|ГДЕ
	|	ТаблицаДокумента.СчетФактура = &СчетФактура
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Ссылка,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Договор.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
	|		ИНАЧЕ ТаблицаДокумента.Договор.СтавкаНДС
	|	КОНЕЦ,
	|	""Выполнение СМР по объекту строительства: "" + ТаблицаДокумента.Ссылка.ОбъектСтроительства.Наименование";
	
	Запрос.Выполнить();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
